package Lesson.L7_Non_Access_Modifiers;

public class Types_of_Modifiers {
}

// transient. Переменные класса с ключевым классом transient не сериализуются
// native. Методы с ключевым словом native реализованы не на Java. В своем описании они не имеют тела и заканчиваются как абстрактные
//                  методы символом ";"
// synchronized. Методы с ключевым словом synchronized могут быть использованы в одно и то же время только одним потоком
// volatile. Переменные с ключевым словом volatile могут быть изменены разными потоками и данные изменения будут видны во всех потоках.
// strictfp. Ключевые слово strictfp в методах и классах ограничивает точность вычеслений с float и double по стандарту IEEE.
